{
	"entries": [
	  {
		"title" : "Tips for Filipinos to spend income wisely",
		"content": [
		  "Goals can help you stay on the right path. They must be developed based on the S.M.A.R.T principle—Specific, Measurable, Attainable, Realistic, and Time-bound. This will serve as a guide on targeting goals that are appropriate for each life stage and are centered on priorities and changing needs.", 
		  "Make savings a habit even with little income with the 50/30/20 budgeting rule: allocate 50% of income to needs, 30% to wants, and 20% to savings or emergency funds. This will help you maximize your income and ensure that there are funds available for you once you need it.",
		   "Although there's an option to spend on wants, it is important to prioritize needs first. Wise spending involves a balanced approach to expenses and getting financially protected at the same time. Always make sure your needs are met first before spending money on something you desire.",
		    "identify unnecessary spending, eliminate potential financial problems, as well as knowing the amount that can be saved and invested. Remember, don’t spend more than what you earn!",
			"Researching investment products is crucial, so be cautious when selecting reputable companies to ensure that investments are safe and well-managed. To build wealth steadily, it is important to start investing as early as possible. Allocate part of your savings to life insurance and investment products so you can prepare for the future and you can make your money work harder for you."
		],
		"author": "https://www.sunlife.com.ph/en/life-goals/grow-your-money/bright-tips-to-spend-income-wisely/"
	  },
	  {
		"title": "50-20-30 rule for saving money",
		"content": [
		  "50% of your money should be allocated for needs. This is the most important expense vertical that needs to be met. A 50% allocation is given to this because these are items/products/payables that enable us to go on with our daily lives. Though it may be tricky for some wants to cross over as needs here’s a guide: Needs are defined as essentials that you need to live.",
		  "While 20% of your money is portioned for savings. It is never too early to start building up your savings funds. You may be hearing a lot about emergency funds as the world is hit by a pandemic but this is something that you must also prioritize to help you secure your future and keep you out of debt. Savings can also mean it is for money management such as savings for debit payments. This is a good tip that can help you avoid drowning in debt as well. Another way of saving could also be allocated for milestones such as retirement. But overall 20% of all your money should go to these savings items/goals.",
		  "hen 30% of your money goes to our favorite segment, our wants. These include the things we desire and not necessarily what we need. These include your favorite food from fancy restaurants, high-end gadgets, and alike. Though it’s okay to spend a few luxuries every once in a while, your priority should still be the portion for needs and savings. To better manage your income, especially in this pandemic, one should know the delineation of needs and wants. Then, you can keep track of your spending and more importantly where your money goes."
		],
		"author": "https://www.pnb.com.ph/index.php/rule-saving-money?tpl=1"
	  },
	  {
		"title": "Managing Money the Filipino Way",
		"content": [
		  "A lot of people tend to overspend when using debit or credit cards. Paying with cash lets you be more aware of the money that you let in and out. Set a certain cash budget for your daily expenses, and only withdraw extra if there’s an emergency. Also, try to leave your cards at home to avoid the temptation of using them for shopping or other unnecessary spending.",
		  "tems at convenience stores tend to cost more compared to groceries and markets. For example: a cup of instant noodles has an SRP of P30. But in convenience stores can sell them for up to P40 each. To save money, try to buy your supplies in bulk in groceries weekly. Not only do you save money, but you also can manage your expenses better this way.",
		  "Buying used instead of new items is a great way to save money. This may not apply to all things like appliances, but for others like clothes and accessories, you can find quality items which are almost as good as brand new.",
		  "be on the lookout for price drops, instead of buying what you want on the first day of its release. This applies to most things such as appliances and clothes."
		],
		"author": "https://www.robinsonsbank.com.ph/knowledgebank/pinoy-money-hacks-managing-money-the-filipino-way/"
	  },
	  {
		"title": "5 tips to save money while enjoying life",
		"content": [
			"You have to be clear about your family's source of income. Before you decide whether to save money or to spend more, first you need to understand the spending habits of your family members. Make a plan and check how much you spend weekly.",
			"There's nothing wrong with thinking twice before making any purchase. For instance, buying a car is not a one-off deal, especially when you choose to pay in installments. Fuel prices that go up and down, parking, maintenance fees, unpredictable expenses for repair... Are you able to handle the extra amount you have to budget for that are not included in the price tag of this new car? Think twice.",
			"You'll need clear short-term and long-term goals that help you allocate your expenses appropriately. Keep your goal in mind, and you'll be able to manage your expense within the budget by making these small changes in life.",
			"In addition to a general savings plan, there are options like buying savings insurance or setting up multiple savings accounts that help you with your different goals.",
			"To manage your family finance effectively, you set aside an amount for expenses incurred during the month. Calculate and keep your compulsory expenses such as electricity and water bills in record. After deducting your compulsory expense and your saving goal from the overall income, you'll have an idea of how much you could spend at most for the month. "
		],
		"author":"https://www.manulife.com.ph/about-us/blog/5-tips-to-save-money-while-enjoying-life.html"
	  },
	  {
		"title":"Benefits of saving money",
		"content":["Life can be full of surprises, and having extra money saved can be a financial lifesaver during these times. Whether it is a medical emergency, car repairs, or sudden job loss, having a safety net to fall back on can provide much-needed stability.",
		"Having some money tucked away is like having a cozy blanket of safety. When you save money, you can feel less worried about what might happen. Having savings allows you to navigate life's uncertainties with greater confidence.",
		"Savings serve as the foundation for future investments. When you save money, you can later invest in stocks, real estate, or starting a business. A solid savings base gives you the capital to explore new opportunities.",
		"Saving money teaches you to be responsible and make good choices with your money. Saving money requires discipline and self-control. It is like training your brain to make smart decisions, a valuable skill for your future."
	],
		"author":"https://www.homecredit.ph/wais-sa-home/guest-blogs/manage-your-money"
	  },
	  {
		"title":"Effective Saving Strategies",
		"content":["Automating your savings makes it easier to do regularly. You do not even need to think about it anymore in most cases. Decide how much you want to save each money and set up an automated transfer of that portion of your income to a separate savings account.",
		"Imagine a crossroad with no traffic lights. It would be chaos with cars and buses coming and going from all directions. Setting a budget directs your money where it should be. It is the traffic lights for your cash flow.",
		"Debt is a tool like a hammer or a saw. If you do not know how to use it properly, you could hurt yourself. But once you learn the skill, you can build things with it. Debt management is learning how to handle debt so you can avoid money troubles in the future."
	],
		"author":"https://www.homecredit.ph/wais-sa-home/guest-blogs/manage-your-money"
	  },
	  {
		"title":"Three types of debt",
		"content":["Good debt is when you use the money for Needs",
		"Bad Debt is when you use the money for wants",
		"Ugly Debt is when you use the money for wants and borrowed it at an abnormally high interest rate"
	],
		"author":"https://www.homecredit.ph/wais-sa-home/guest-blogs/manage-your-money"
	  },
	  {
		"title":"Questions to ask yourself before borrowing money",
		"content":["Is this a need? Think if what you want to borrow is necessary. ",
		"Do I need this today? Consider if you can wait and just save money to buy it.",
		"Can I afford to pay for this? Make sure you can make regular payments without straining your budget."
	],
		"author":"https://www.homecredit.ph/wais-sa-home/guest-blogs/manage-your-money"
	  },
	  {
		"title":"Tips for growing your money even as you spend everyday",
		"content":["Winning at the savings game is not about occasionally putting big amounts into your savings account. Rather, remaining consistent in your contributions is what matters the most. While it certainly feels “responsible” in the moment, putting in more than you can handle in your account is not going to be sustainable in most instances. If you have a limited income, it’s a good idea to start small and let the compound interest do most of the work. You can always increase your contributions as your income expands.",
		"Set aside money responsibly to make sure you don’t spend it on unnecessary expenses. This proactive approach will allow you to build a strong financial foundation and will let you develop disciplined saving habits.",
		"Saving becomes far easier if you have a comfortable income. By investing in courses, certifications, or even books, you can ramp up your earning potential and find better-paying employment or business opportunities down the road.",
		"If you see something you want to buy, sleep on it for a few days before tapping your savings. Giving yourself time to think over big-ticket purchases or even less costly expenses can help ensure you're making more thoughtful financial decisions.",
		"Money saved is just as valuable as money you earned. This is not a mindset that comes naturally to most people, and it must be actively developed over time. Having such a perspective can make it more difficult for you to spend money without thinking. Once it’s ingrained into your day-to-day living, wiser financial decisions will just come more naturally to you.",
		"While it’s important to save, celebrating small financial milestones can strengthen your motivation to keep saving. Rewards don't have to be expensive.",
		"It goes without saying that even a mild chronic or acute illness or injury can affect your savings contributions and delay your journey to prosperity. Though health problems can’t always be avoided, maintaining a wholesome lifestyle will certainly put the odds in your favor."
	],
		"author":"https://www.maya.ph/stories/9-tips-for-growing-your-money-even-as-you-spend-every-day"
	  },
	  {
		"title":"Tips in Growing Money in the Philippines",
		"content":["Understanding how to be wise in using your money to have enough savings starts with budgeting. Track your income and expenses. This helps you identify areas where you can cut back and increase your savings rate.",
		"In understanding how to grow your money in the Philippines, considering high-interest time deposits is a wise move. Time deposits offer higher interest rates than regular savings accounts, making them a more lucrative option for your savings growth. By committing your money for a set period, you benefit from these higher rates. They’re an excellent choice if you have funds that you won't need immediate access to, allowing your money to grow undisturbed over the deposit term. Moreover, this strategy can significantly boost your savings, especially in the long run.",
		"For those wondering how to grow money in a bank with a bit more risk, money market funds are an option. They offer potentially higher returns than traditional savings and are still relatively low risk. Unlike a regular savings account, money market funds invest in short-term debt securities, making them a more dynamic option for your investment portfolio.",
		"Consistency is key to being wise and growing your savings. Establish a regular deposit schedule to ensure continual growth. Small, consistent deposits can significantly accumulate, leveraging the power of compound interest. This approach is effective for all, from those just starting their savings journey to long-time investors. It's about making saving a habit, and over time, even modest deposits can transform into a substantial nest egg.",
		"Regular monitoring of your bank account is crucial for both security and financial management. Keeping a close watch helps you track your progress, spot any discrepancies early, and make timely adjustments to your saving strategy. ",
		"Interest rates are a critical factor in the growth of your savings, especially when considering a high-interest savings account in the Philippines.  They can fluctuate based on economic conditions, so staying informed about these changes is essential. Understanding the impact of interest rate fluctuations on your savings can guide you in making strategic decisions, like when to switch accounts or choose different banking products for maximized returns.",
		"Another way to grow your money in the bank is to avoid extra fees. Be vigilant about bank fees, as they can significantly reduce your savings over time."
	],
		"author":"https://www.rcbc.com/how-to-grow-your-money-in-the-bank"
	  },
	  {
		"title":"How to know if you have right money habits",
		"content":["A common money habit people have is living beyond one’s means. You may not realize it, but if you use a credit card and don’t pay off the bills in full each month, you’re already spending more what than you have. And it's not just credit cards. Living beyond your means can also include buying a home that's too expensive for you or taking out loans that you can't afford.",
		"Planning and sticking to a budget is one of the most important things you can do to stay financially afloat. But even if you're the most disciplined person in the world, there can still be times when you overspend or fail to budget correctly. When that happens, don't beat yourself up - just take corrective action immediately.",
		"One way to combat going over your budget is to create a buffer. This is a portion of your budget where you allocate a little extra money each month so that if you do go over in one category, you have some wiggle room. This will help to keep you from dipping into other areas of your budget or going into debt.",
		"Another helpful tip is to track your spending very carefully. Several apps and websites can help with this, or you can simply write everything down in a notebook. By keeping a close eye on where your money is going, you'll be more likely to catch areas where you're overspending and can adjust accordingly.",
		"One of the biggest financial mistakes that people make is not saving for retirement. A lot of Filipinos think that they don't need to start saving for retirement until they're older, but that's not true. The sooner you start saving, the more time your money has to grow. If you don't start saving for retirement early, you may find yourself struggling financially when you retire.",
		"One of the best ways to save for retirement is to open a retirement account with a local bank or investment firm. These accounts offer tax breaks and other incentives that can help you make the most of the money you invest.",
		"If you want to avoid these unhealthy Pinoy money habits, it's important to learn about personal finance and develop good money management skills early on in life. Financial literacy is not something that's taught in schools, so it's up to parents and guardians to teach their children about money matters from an early age.",
		"Learning to budget, save, and invest can set you up for long-term financial success and reduce stress in the present. Good money habits also lead to being able to make smart financial decisions. It's important to remember that good money habits take time and dedication to form. It's not always easy, but having control over your finances can bring peace of mind and a feeling of empowerment."
	],
		"author":"https://www.metrobank.com.ph/articles/learn/do-you-have-right-money-habits"
	  },
	  {
		"title":"Where do you put money",
		"content":["We use the bank for our short-term savings and for our emergency funds, where it is easily accessible. Despite the small interest, it’s still better to keep our money for this purpose in the bank, instead of keeping them under our mattress. Banks now offer different products that can earn you better interest rates.",
		"Life insurance will ensure that our money goals for our family are realized even when my husband and I are no longer in the picture",
		"The extra money we have after savings and insurance, we put in investment instruments where it can grow for our mid to long-term needs.  These are mutual funds, stocks, and equity investments.",
		"we don’t have to be rich to start investing. One can start investing for as low as P50",
		"Let’s always be mindful that being born poor or moneyless is not our fault.  But to die still poor and moneyless despite the opportunities around us is already our fault."
	],
		"author":"https://www.pna.gov.ph/opinion/pieces/460-i-have-money-where-do-i-put-it"
	  },
	  {
		"title":"Money Saving Tips for Everyone",
		"content":["You need to set financial limits for yourself to avoid overspending your money on a single purchase. Whether it’s your daily expense or a special occasion, don’t spend a single peso without following a certain budge.",
		"Whether it’s a pair of sunglasses or a car insurance policy, have more patience in comparing prices and searching for better alternatives. This will help you find better deals and prevent you from overspending.",
		"You’ll find it hard to save money if you are always sick. Unless you have a pre-existing condition, you should always keep yourself healthy. Eat right, exercise, and drink enough water for the day. Also, get vaccinated already! It’s literally free.",
		"While saving for the future is important, saving for the near future is equally as important. Your emergency fund will shoulder you from unexpected expenses like medical fees, car damage, house restorations, among others.",
		"Saving money and saving for the future are two different things. To effectively save money, you should add a purpose to it. Save money for future use, like buying your first home, or funding your first car."
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips for Families",
		"content":["Encourage everyone in the family to talk about money and teach your kids some of your best money-saving tips. That way, they’ll learn how to prioritize needs over wants at an early age.",
		"Most medicines have generic brands that have the same effect if not better. Just like what the commercial says, don’t be shy to ask for the generic option.",
		"No matter how big the size of your family is, there is a fuel-efficient car that will provide you with a comfortable ride. So instead of focusing on the color, size, or model, consider a car’s fuel efficiency before starting your amortization. "
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips for Millennials",
		"content":["Get yourself a credit card but be responsible in using it. If you can’t afford to pay it in cash, never pay it with your credit card. It’s just that credit cards allow you to access discounts, promos, and other perks. They are more ideal for daily transactions compared to cash.",
		"Whenever you’re about to make a big “want” purchase, sleep on it for two days. After that, decide whether you still want to buy it and that you’re ready for the consequences of buying it. That’s how you make an informed decision.",
		"Instead of buying food outside, learn how to cook a proper meal. Not only will it save you money, you’ll also pick up a valuable life skill. You’re an adult stuck at home so use your time wisely.",
		"There’s nothing wrong with living the hustle life. You can start setting up a business at home like loading stations, online buy and sell, home-cooked food delivery service, among others."
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips for Students",
		"content":["Students nowadays can open their own savings accounts. All you need is a school ID and any other proof that you are currently a student. Start saving as early as now.",
		"Don’t give in to peer pressure and always be in control of your decisions. Developing vices can lead to not only financial problems but moral bankruptcy as well.",
		"Challenges like the 50-Peso Challenge or the 52-Week Money Challenge are fun ways to learn the importance of saving money. This will further develop your money-saving habits, plus you’ll get to be part of a trend.",
		"There are a lot of them that most students don’t know about. Use these government-mandated discounts to save money while also having fun."
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips for Couples",
		"content":["Students nowadays can open their own savings accounts. All you need is a school ID and any other proof that you are currently a student. Start saving as early as now.",
		"Don’t give in to peer pressure and always be in control of your decisions. Developing vices can lead to not only financial problems but moral bankruptcy as well.",
		"Money is somehow a taboo topic for couples. You should be more open when it comes to financial matters. You don’t have to resent one another for having a higher salary or any other insecurities when it comes to money. Help each other to achieve your goals.",
		"Because there’s two of you, your chances of gaining high returns are greater since you can help educate each other. You can either pull your resources together or explore different investment opportunities separately.",
		"Having separate bank accounts can help organize your finances better. As they say, don’t put all your eggs in one basket.",
		"Peg your night-out at a fixed amount for dinner, drinks, and travel. Even stay-at-home dates need budgeting for food deliveries and online streaming subscriptions. "
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips for Singles",
		"content":["Avoid toxic people and choose friends who are more frugal and money-savvy. This will inspire you to save more money, plus you’ll get to learn more money-saving tips from their experiences. Just don’t borrow money from them.",
		"Use your free time being single to learn more about how to improve your finances. The Moneymax blog is a great place to start.",
		"You’ll be tempted to overspend on snacks instead of healthy and nutritious food. You’ll definitely find it hard to stay within your budget if you’re too hungry to care.",
		"Spending money won’t always cure the bad day you’re having. Learn how to pick yourself up without resorting to splurging."
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Money Saving Tips at work",
		"content":["If the company allows it, choose to work from home. You’ll save a lot of money on transportation, food, and other daily overhead costs back when you were part of the daily grind at the office.",
		"Ask your HR representative about it and find out how you can maximize them. You might find benefits that will help you save a lot, especially in medical expenses.",
		"Instead of spending it on lavish items or Christmas gifts, deposit them in your savings and emergency fund. Why not explore other investments as well? Or better yet, pay off your debts so you can make way for more savings. "
	],
		"author":"https://www.moneymax.ph/personal-finance/articles/tips-on-saving-money"
	  },
	  {
		"title":"Maximize income as a fresh graduate",
		"content":["Don't underestimate the power of negotiation when it comes to your starting salary. Research industry standards, highlight your skills and achievements, and confidently advocate for fair compensation. Negotiate for a competitive salary as it will set the stage for financial growth and stability. It will allow you to build momentum towards your goals from day one. Along with fair compensation, you also have to track your expenses and take into account how much you are saving to achieve your future goals.",
		"Networking is a powerful tool for career growth and income maximization. Cultivate relationships with experienced professionals in your industry who can offer guidance, advice, and valuable insights.",
		"Professional skills development will reward you in the long run. Stay ahead of the curve by acquiring new skills, earning certifications, and pursuing further education relevant to your field. Not only does continuous learning enhance your value in the job market but it also opens doors to higher-paying opportunities and career advancement.",
		"While your primary job provides a steady income, additional income streams can accelerate your progress toward financial milestones. Whether it's freelancing, starting a side business, or investing in passive income opportunities, diversifying your sources of income can enhance your earning potential and help work your way towards financial security.",
		"As you begin to accumulate wealth, it becomes more important to safeguard your savings. Consider investing in insurance plans designed to protect your financial well-being."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/5-tips-to-maximize-your-income-as-a-fresh-graduate/"
	  },
	  {
		"title":"Financial wisdom tips for a brighter future",
		"content":["Saving is one of the important values that has been taught to many. It is a way to ensure that money is set aside for future use so you can meet your life goals. Saving should be non-negotiable. Regardless of how much you earn now, make it a habit to save.",
		"High-interest debts are more difficult to manage and will affect your financial well-being. They can derail your plans and keep you from achieving your financial goals. If you cannot eliminate debt at once, pay off high-interest debts first.",
		"Financial wisdom involves recognizing problems before they become emergencies.",
		"Investing is delayed gratification in practice. Gadgets, cars, and tickets to a new tourist experience are best enjoyed if you’ve also prepared well for the future.  Financial wisdom allows you to enjoy these lifestyle perks guilt-free through the power of compound interest."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/5-financial-wisdom-tips-for-a-brighter-future/"
	  },
	  {
		"title":"Financial wisdom tips for a brighter future",
		"content":["Saving is one of the important values that has been taught to many. It is a way to ensure that money is set aside for future use so you can meet your life goals. Saving should be non-negotiable. Regardless of how much you earn now, make it a habit to save.",
		"High-interest debts are more difficult to manage and will affect your financial well-being. They can derail your plans and keep you from achieving your financial goals. If you cannot eliminate debt at once, pay off high-interest debts first.",
		"Financial wisdom involves recognizing problems before they become emergencies.",
		"Investing is delayed gratification in practice. Gadgets, cars, and tickets to a new tourist experience are best enjoyed if you’ve also prepared well for the future.  Financial wisdom allows you to enjoy these lifestyle perks guilt-free through the power of compound interest."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/5-financial-wisdom-tips-for-a-brighter-future/"
	  },
	  {
		"title":"Achieve financial stability in changing times",
		"content":["Set a realistic budget and stick to it. Expenses should be based on monthly income. One should spend within means to avoid debts. Identify expenses and prioritize the essentials to ensure that even on a budget, the basic needs and other necessary expenses are not compromised.",
		"After the budget and necessities have been identified, check if your income is sufficient for all the essentials. If not, cut the expenses starting from those that will have the least impact even when gone. Modifications to the usual choices should also be done to make ends meet and still have some left for unexpected expenses. For instance, if the Internet subscription is high, shop around. Consider other providers that offer the best prices.",
		"The usual income earned by an individual may no longer be sufficient now that the inflation rate is high and the purchasing power is low. It may be a struggle to make ends meet and live a quality life. Creating additional sources of income will help a person cope with a higher cost of living.",
		"An increase in knowledge and skills can help a person earn more money in the long run. Continuing education may require time, effort, and dedication but it may bring lifelong benefits. It may be a factor why a person will be promoted in the future or be given a higher salary. Learning new skills will also open opportunities for new and better employment.",
		"Some may doubt the idea of investing when the inflation rate is high. When in fact, the right investments can help outrun the impact of inflation. Grab opportunities from affordable investment plans to keep funds growing. Diversify and seek other investment opportunities that can bring huge rewards in the long run.",
		"Health and life insurance plans should not be treated as unnecessary expenses, especially with the benefits that they guarantee. Life-threatening diseases and critical illnesses require immediate treatment.",
		"It is never too early to think about retirement now. No matter what the age is, retirement planning is a must especially if the goal is to achieve financial security.  Look into the future and consider what it will take to be financially free when retirement day comes. Retirement planning will help build the fund that will be needed to have peace of mind and comfortable life even during the golden years."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/5-financial-wisdom-tips-for-a-brighter-future/"
	  },
	  {
		"title":"Financial independence for Millennials and Gen Z's",
		"content":["It is important to determine needs and wants to identify essential from non-essential expenses. This will help one to keep track of his/her spending, avoid living from paycheck to paycheck, and stay away from debts.",
		"Aside from knowing where money is spent, one should also learn how to live within his/her means. It will reduce money-related stress, open opportunities for savings, and slowly move closer to financial independence.",
		"Small and short-term goals are more attainable, making the journey towards financial freedom less difficult. Goals like avoiding the usual non-essential expenses, such as buying coffee or ordering food rather than cooking at home, are simple cuts that are realistic and can deliver great results.",
		"Not having enough money to support essential needs could lead to problems. People whose incomes are insufficient should consider having multiple sources of income. This will spare them from financial turmoil brought by job loss, avoid debts, and get the resources to save more money.",
		"It is essential to set aside at least 6-month's worth of emergency funds to keep you afloat when uncertainties strike. Without an emergency fund, a financial breakdown may quickly happen when unexpected expenses in the future arise.",
		"Life insurance will serve as a security blanket that will keep savings intact even when life's surprises happen. Doing it early will ensure maximum benefits from the plan. It will help protect current savings and impact your capacity to save in the future."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/taking-steps-towards-financial-independence-for-milennials-and-gen-zs/"
	  },
	  {
		"title":"Saving money on minimum wage",
		"content":["Know where money is spent. List all spending to know the biggest expenses and track unnecessary purchases. Simple habits like buying food instead of cooking can take a huge portion of one’s income, especially when done regularly. If unnecessary practices would be eliminated, the unspent amount may be used to start your savings.",
		"Aside from cutting the unnecessary, it is also important to cut down the biggest expenses. For instance, if house rental and transportation costs are among the biggest expenses, the option of transferring to the least expensive place that is easily accessible to the workplace should be considered. This way, housing and transportation costs may be reduced.",
		"o start saving, it is important to settle debts first, particularly those with high-interest rates. Pay off personal loans and credit card bills on time to eliminate huge charges. Create a plan on how it can be paid off. In case, several debts need to be settled, starting with the highest interest rate. Being able to be free from unnecessary charges is another opportunity to save even on a low income.",
		"Having a low income is an obstacle to saving but is not impossible to overcome. There are opportunities to earn more. Freelancing is popular in fast-growing industries.",
		"One has to be aware of the fees that a bank may charge for certain transactions. The required minimum balance must also be maintained, or else hard-earned money may be eaten up due to unnecessary charges.",
		"Healthcare is expensive and it should not be disregarded. While it may seem like an added expense, staying healthy is a step to avoiding unplanned expenses. Basic practices like eating healthy foods, getting the right amount of sleep, exercising, and avoiding vices such as smoking and excessive drinking are the key steps to health protection."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/how-to-save-money-on-a-minimum-wage/"
	  },
	  {
		"title":"Steps to stay track of your financial goals",
		"content":["Financial freedom doesn’t just happen. You have to work for it. One basic step is to start saving money and be serious about it. Ideally, you should save at least 10% of your income per month. Eventually, you can raise your savings to 20% to 30% which will form the fund for your future goals.",
		"Saving money is a habit and a lifestyle. You can cut back on some of your expenses, especially non-essentials. You may also reduce your budget for your usual spending. If you spend a lot on restaurant food, change it. Reduce eating out or food deliveries. You’ll be surprised at the amount that you’ll be able to save by modifying your habits.",
		"To stay focused, you should have a clear vision of your goals. It’s not enough that you’re saving a percentage of your income. You should give it a purpose. Set aside a certain amount for a specific goal. For instance, the amount you’ll initially save can be allotted for your emergency fund. After that, you can focus on funds for your retirement. It will be easier to make sacrifices if you know exactly what you’re doing it for. Saving is a habit and skill that you can use for a lifetime.",
		"Feed your mind with information that can help you become better at handling your finances. There are financial books and online resources that will help you learn more about how to successfully manage your money so it will grow at a faster rate.",
		"Once you gain valuable knowledge from reliable resources or your financial advisor, you should also strive to be better at handling your finances. Apply the knowledge you acquired from financial experts by keeping your personal finances in check."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/smart-steps-to-keep-track-of-financial-goals/"
	  },
	  {
		"title":"reasons to invest now",
		"content":["As investing is a long-term venture, the earlier you start, the longer time you have to make the most of your investment.",
		"With investments, you'll be able to get returns and build wealth over the long term.",
		"By the time when you can no longer work, you'll still earn from the investments you made while you were younger.",
		"Investment vehicles offer greater earnings than savings accounts.",
		"By investing, you'll have the financial preparedness to achieve your long-term goals."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/investment-opportunities-in-the-philippines-for-millennials/"
	  },
	  {
		"title":"how to spend first paycheck",
		"content":["One key to living in peace and prosperity is to be debt-free. Do a quick audit of your bills and prioritize the payments that should be made. “Align your mind, heart, and work of hands,” Inigo said. For the mind, it is essential to set your goals so it would be clear why you are working for it. Our hearts are to blame for over-spending. Sometimes, you can’t help but feel overwhelmed and your emotions will push your discipline to its limit. Practice self-control to avoid unnecessary spending. Most importantly, execute your plans. Be bold, money-wise, and innovative to stick with your long-term goals.",
		"Most of us overlook the fact that sometime in the future, we may encounter a situation that will result in extra expenses. It could be minor such as replacing a broken stove or major such as paying for hospital bills. An emergency fund will save us from these unexpected circumstances.",
		"You are in a phase of life wherein you have the energy to work and the opportunity to explore the world. The future is indeed in your hands! One of the most important components of successful financial planning is having a good financial foundation to protect you against the uncertainties of life."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/first-paycheck/"
	  },
	  {
		"title":"tips to be more budget savvy",
		"content":["From that impulsive milk tea purchase to that sofa bed you bought on a three month installment basis, record everything you spend your money on. If you can, compile past bank and credit card statements to have an estimate where your money is going every month.", 
		"We all know that the swipe feature of credit cards make it easy for you to overspend. Using credit cards allows you to spend money you don’t have thus putting you at a great risk of incurring debts.",
		"To avoid costly charges from unpaid balances, pay your credit card bills on time. Set an alarm on your phone so you don’t miss it.",
		"For beginners, why not give a Unit Investment Trust Fund (UITF) a try? UITF pools the funds of investors to create a large fund managed by an investment manager. Banks offer UITF investments for as low as P10k.",
		"Cutting your spending doesn’t have to involve cutting enjoyment from your life.",
		"There are a lot of personal finance podcasts available and you can tune in to them for free.",
		"Turn off the lights when not in use. Did you know that plugged-in devices eat up a minimal amount of energy? So unplug those gadgets like that electric kettle sitting on the sink all day.",
		"Avoid doing the grocery run when you’re hungry as you’ll spend way more than what you actually need.",
		"Buying in bulk is the way to go. Think of household staples – laundry detergent, fabric conditioner, toilet paper, etc. Consider buying the unbranded brands in the grocery store.",
		"If you can walk to the office, the better. It’s not only good for your pocket but for the environment, too.",
		"Commit to buying nothing for a day and see how liberating it is."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/25-easy-tips-budget-savvy/"
	  },
	  {
		"title":"save more when shopping online",
		"content":["Needs are different from wants; needs are as things that would enable you to live, work, and earn. Food, medicine, and building your savings take priority over that new dress you are obsessing over. Make a list of “needs” and “wants” and consult the “needs” list first before making any “wants” purchases.",
		"You know how much you make per day, right? Then think of that impulsive purchase in terms of your hourly wage. Suddenly, that online cart full of mystery boxes isn’t so exciting when they equal to two weeks worth of hard work.",
		"While shopping IS fun, a lot of us treat it as a knee-jerk reaction to what’s happening to and around us: boredom, stress, procrastination, and yes, even heartbreak. Before clicking that app, do a double take and ask yourself: is this is an escapist response? A good run or a movie might be a smarter and more frugal investment of your time and money.",
		"Why not set aside a modest amount every month dedicated to online shopping? To limit yourself, consider never paying for COD or cash on delivery. Instead, use the shopping app’s loadable credit system. Once your app credits run out, so does your budget. Added bonus: this can save you from scrambling to prepare an exact amount on CODs.",
		"If you have to intercept the delivery guy in order to keep your wife or husband from finding out you bought something AGAIN, then it is high time to re-evaluate your shopping habits. Big ticket items should be discussed with your partner, especially if you’re living together. Treating it as a joint effort can make for a more harmonious co-habitation.",
		"One useful trick in making any important and costly decision is to sleep on it first. A refreshed and relaxed mind is more likely to make a responsible decision than a tired, stressed one.",
		"If the mere sight of that colorful shopping app is so tempting, UNINSTALL it. Just reinstall it on special or scheduled periods. The convenience and “deals” will always just be a click away."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/how-to-avoid-overshopping-online/"
	  },
	  {
		"title":"ways you can invest and profit in stocks",
		"content":["Investing in blue-chip stocks is a low-risk strategy to build your wealth on the stock market. Blue-chip companies are generally leaders in their fields, have been in business for decades, have market capitalization, value in the billions, and are run by seasoned managers with a track record for delivering stable growth and returns.",
		"Investing in blue-chip shares offers low risk and but also low returns. Penny stocks are the opposite – these are high-risk or 'speculative' investments because the companies behind them are relatively young, have low market capitalization, and even unproven management teams.",
		"Day trading is about buying and selling penny stocks in a single day or several times a day to make money from ‘intraday’ [the buying and selling of shares on the same day] price fluctuations on the share market. Buy low and sell high is the nature of the game.",
		"Mutual funds are not exactly stocks but they are popular alternative for DIY investors. A mutual fund is comprised of several investments (e.g. stocks, equities, money market, etc.) with several investors pooling their funds together to invest.",
		"dividend investing focuses on stocks that pay dividends – regular, scheduled cash payouts drawn from a portion of the company's earnings. Dividend investing lessens some of the risks of investing in the share market because even if the price of a stock goes down, as an investor, you’ll receive something.",
		"A recession is part of the normal business cycle when there is a general economic slowdown. Buying shares during a recession or bear market, when the majority of investors are selling and the risk of company bankruptcy is higher, requires nerves of steel and eagle-eye insight to identify opportunities to pick up high-quality stocks at discounted prices.",
		"You buy stocks and hold them for a long period of time, regardless of fluctuations in the market. This requires patience and regular, careful decision-making. The aim is to spot trends in the market and capitalize on these."
	],
		"author":"https://www.sunlife.com.ph/en/life-goals/grow-your-money/six-plus-1-ways-you-can-invest-and-profit-in-stocks/"
	  },
	  {
		"title":"Ways to stop emotional spending",
		"content":["Try to recall what emotions drive you to spend money unnecessarily. Do you spend when you’re happy to treat yourself, or do you spend when you’re feeling down to cheer yourself up? Sometimes, all it takes is for you to be aware, and you’ll be more cautious the next time you decide to swipe your card.",
		"A great way to reduce your impulse shopping is to give yourself 24 hours before you commit to buying something, especially if it’s not a necessity. This waiting period will give you more time to think it through properly before you make a decision. Most of the times, once your emotions have settled down, you’ll find that you don’t really need the item after all.",
		"It’s good to give yourself a little treat once in a while, but constant impulse buys and spending beyond your means will lead to financial problems, especially if unexpected expenses come up. Setting a budget for your “wants” will allow you to buy yourself something nice without going overboard. Once you’ve reached that budget for a month, you’ll know not to spend further. ",
		"Sometimes, you may not realize how much you’ve been spending unnecessarily. By calculating how much emotional spending has impacted your finances, it gives you a clearer picture of where your hard-earned money is going. Although you’re able to afford something, it does not mean you should buy it. The money you spend could be put to better use instead. ",
		"If you’re a frequent impulse buyer who has gotten into the habit of emotional spending, it may be difficult to break the habit right away. Getting support from a professional and/or loved ones can help you get started on getting your spending habits on track."
	],
		"author":"https://singlife.com.ph/about/blog/ways-to-stop-emotional-spending/#"
	  },
	  {
		"title":"Guide to Saving Money",
		"content":["One of the easiest ways to ensure having a tidy sum left over after the necessary expenses is to set limitations on how much you can or should spend monthly. This means drawing up a reasonable budget that takes your family’s necessities into account while curbing overspending. Budgeting is especially helpful for homemakers who often find themselves short on money at the end of every month.",
		"Banks are always coming up with new and exciting offerings to attract more clients. Some of these products can be very helpful to homemakers looking to make the most of their money. For example, some banks offer credit cards that do away with annual fees entirely. Others propose high interest rates on their savings accounts for clients that can maintain a certain amount of money in them.",
		"Another way to save money while shopping is to do so with intent. Never go to the supermarket or department store without already knowing what you need to buy. This will prevent you from purchasing items that you don’t need on a whim. It’s also prudent to compare products and seek out more reasonably priced alternatives before committing to any purchases. Be brand-blind! For example, most local supermarkets sell their own versions of popular goods and products alongside those from bigger, more well-known brands. You’ll often find that the supermarket versions are cheaper, though the quality is the same. Finally, supermarkets often have a dedicated aisle or display for products they’re selling 2-for-1 or at reduced prices. Even if money isn’t particularly tight, visiting that area every so often can help you discover bargains on some of your family’s favorite grocery items.",
		"You can do a lot with a sensible budget and by changing your buying habits, but if you want to save even more money, you’ll want to look into reducing your household expenses. Making small but meaningful changes to your current lifestyle might seem insignificant in the short term, but the savings you gain from them do add up.",
		"You can save as much as 15% on your consumption simply by unplugging devices when they’re not in use. Switching from incandescent or fluorescent bulbs and fixtures to LED bulbs also helps you conserve energy by anywhere between 20% to 85%. Is the house too warm during the day? Minimize air conditioner usage by painting your walls a lighter color, which reflects heat instead of absorbing it. Finally, replacing your most regularly used appliances with more energy-efficient models also helps in conserving power.",
		"Meat, eggs, and dairy are expensive and are becoming even more so by the day. Eating less of them translates into instant savings at the checkout lane. Incorporating more fruits and vegetables into your family’s diet and eating healthier also reduces your chances of getting sick, which in turn helps you avoid costly medical bills further down the line. If you have the space and time, you can also start growing your own food, an activity that can be both financially and emotionally rewarding. Finally, choosing to prepare your own food and to eat at home instead of splurging on a fancy dinner for special occasions can also really help your bank account fatten up over the long term.",
		"Unsubscribing to services is another great way to put money back into your wallet. To do this, make a list of every service you’re subscribed to, from cable television to video streaming platforms to gym memberships. In the case of video streaming services specifically, you may find that there’s plenty of overlap between platforms. You’ll save money by eliminating redundancy and canceling any services that you haven’t used in the last month.",
		"it’s also a good idea to look into buying gently used or secondhand items. In many cases, this can actually be more cost-effective than buying something new but low in quality.",
		"knowing how to take care of common household issues early can go a long way towards avoiding costly repairs later on. At the very least, you should know how to fix a leaky faucet, unclog a malfunctioning drain or toilet, and patch up dings and holes in the wall all your own.",
		"Having a goal can help you stay motivated and can inspire you to continue putting away just that little bit more money every month. You can choose a short-term goal, such as saving up for a new TV or an overseas trip, or long-term goals such as putting a down payment on a dream home or saving up for your retirement."
	],
		"author":"https://www.robinsonsbank.com.ph/knowledgebank/the-quick-and-easy-filipino-homemakers-guide-to-saving-money/"
	  }
	]
  }
  
